#### BreakPatternCondition Enumeration

---

|  |
| --- |
| See Also |

Condition on which patterns distribution will be broken.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public enum BreakPatternCondition ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BreakPatternCondition ``` |

| Visual C++ |
| --- |
| ``` public enum class BreakPatternCondition ``` |

# Members

| Member name | Description |
| --- | --- |
| EachSegmentEnd | Patterns distribution is broken at each segment end. |
| AnglesGreaterThan | Patterns distribution is broken if the angle between neighboring path segments is greater than the defined. |
| Never | Patterns are distributed along whole path of a railing. |

# See Also

Autodesk.Revit.DB.Architecture Namespace